In [2]:
import numpy as np
import pandas as pd

# pandas attribute **Series**

In [9]:
pd.Series(data=[3,4,5,8],index=['a','b','c','d'],)

# here v pass a iterable and index values rreprsenting those iterables.

a    3
b    4
c    5
d    8
dtype: int64

In [16]:

# passing a dictionary to the series attribute.
dt_dict={'a':3,'b':10,'c':60}
pd.Series(dt_dict)

a     3
b    10
c    60
dtype: int64

here dictionary automaitcaly converted to series object

In [14]:
category={0:'HEALTH',1:'WORLD',2:'SCIENCE'}
cate_sr=pd.Series(category)
cate_sr

0     HEALTH
1      WORLD
2    SCIENCE
dtype: object

In [15]:
type(cate_sr)

pandas.core.series.Series

# Adding two series objects

In [18]:
items={'a':10,'b':20,'c':30,'d':40}
new=pd.Series(items)

In [19]:
items2={'a':12,'e':45,'c':56,'g':60}
new2=pd.Series(items2)

In [21]:
new+new2

a    22.0
b     NaN
c    86.0
d     NaN
e     NaN
g     NaN
dtype: float64

here same key present in both the series are added and keys that not appear in both returned a NaN value

In [23]:
pd.Series([4,5,6,7],['f','g'])


# here shows error since both length doesnt match

ValueError: Length of passed values is 4, index implies 2

In [25]:
new=pd.Series([1,2,3,4],['a','g','h','j'])
new

a    1
g    2
h    3
j    4
dtype: int64

first argument is data and second is the index 
both r impportant

# fetching data from a series using its index

In [30]:
new['h']

3

In [28]:
new['j']

4

In [3]:
import pandas as pd
pd_sr=pd.Series([500,300,200],['a','g','h'])
pd_sr
pd_sr['h']

200

# DataFrame in Pandas

In [8]:
from numpy.random import randn
data=randn(3,3)
data

array([[ 0.36770172, -2.03267295,  1.27679566],
       [ 0.30274799,  0.4397913 , -0.75184585],
       [ 0.66376531,  1.5412969 , -0.50297831]])

In [9]:
# pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

df=pd.DataFrame(data,['row1','row2','row3'],['col1','col2','col3'])


data : ndarray (structured or homogeneous), Iterable, dict, or DataFrame     Dict can contain Series, arrays, constants, or list-like objects

 index : Index or array-like
     Index to use for resulting frame. Will default to RangeIndex if
     no indexing information part of input data and no index provided
 columns : Index or array-like
     Column labels to use for resulting frame. Will default to
     RangeIndex (0, 1, 2, ..., n) if no column labels are provided

In [10]:
df

          col1      col2      col3
row1  0.367702 -2.032673  1.276796
row2  0.302748  0.439791 -0.751846
row3  0.663765  1.541297 -0.502978

Constructing a DataFrame usng Dictionaries.
here keys in dictionaries r traeted as columns.
and index is assigned default values

In [23]:
data={'col':[3,4,10],'col2':[5,6,2],'col3':[7,8,40]}
df=pd.DataFrame(data)
df

   col  col2  col3
0    3     5     7
1    4     6     8
2   10     2    40

In [19]:
df['col'][0]

# retrieving first value having index 0 from first column

3

In [20]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

# Selecting a value from a dataframe

In [21]:
df['col'][2]

10

In [23]:
df['col3'][2]

40

Selecting more no of columns from the  dataframe

In [25]:
df[['col','col2']]

   col  col2
0    3     5
1    4     6
2   10     2

In [24]:
df

   col  col2  col3
0    3     5     7
1    4     6     8
2   10     2    40

# Adding a new column to existing dataframe.

which contain values that r obtained by multiplying col and col3 values.

In [25]:
df['col4']=df['col'] * df['col3']
df

   col  col2  col3  col4
0    3     5     7    21
1    4     6     8    32
2   10     2    40   400

In [27]:
import pandas as pd
details={'name':['jissmon','Ajith','Vikram'],'age':[45,66,22],'skills':['Python','JavaScript','Ruby']}
df=pd.DataFrame(details)
df

      name  age      skills
0  jissmon   45      Python
1    Ajith   66  JavaScript
2   Vikram   22        Ruby

Adding a new column to the dataframe

In [28]:
exp=[12,10,14]
df['experience']=exp
df

      name  age      skills  experience
0  jissmon   45      Python          12
1    Ajith   66  JavaScript          10
2   Vikram   22        Ruby          14

In [20]:
# selecting name and skills dfrom the dataframe
df[['name','skills']]

      name      skills
0  jissmon      Python
1    Ajith  JavaScript
2   Vikram        Ruby

In [31]:
# created a new columns salary by multplying age and skills columns in the df.

df['salary']=df['age'] * df['experience'] * 100

In [32]:
df

      name  age      skills  experience  salary
0  jissmon   45      Python          12   54000
1    Ajith   66  JavaScript          10   66000
2   Vikram   22        Ruby          14   30800

# Delete a columns from the Dataframe

In [33]:
loc=['Chennai','Kochi','Delhi']
df['location']=loc

In [34]:
df

      name  age      skills  experience  salary location
0  jissmon   45      Python          12   54000  Chennai
1    Ajith   66  JavaScript          10   66000    Kochi
2   Vikram   22        Ruby          14   30800    Delhi

In [40]:

# use drop () to drop a column from dataframe.

df.drop('location',axis=1,)

# specify label as 'location' and give the axis value, here axis=1 since 'location' is a column

      name  age      skills  experience  salary
0  jissmon   45      Python          12   54000
1    Ajith   66  JavaScript          10   66000
2   Vikram   22        Ruby          14   30800

df.drop(
    labels=None,
    axis=0,
    index=None,
    columns=None,
    level=None,
    inplace=False,
    errors='raise',
)


Remove rows or columns by specifying label names and corresponding
axis, or by specifying directly index or column names. When using a
multi-index, labels on different levels can be removed by specifying
the level.

Parameters
----------
labels : single label or list-like
    Index or column labels to drop.
axis : {0 or 'index', 1 or 'columns'}, default 0
    Whether to drop labels from the index (0 or 'index') or
    columns (1 or 'columns').
index, columns : single label or list-like
    Alternative to specifying axis (``labels, axis=1``
    is equivalent to ``columns=labels``).

# drop rows from dataframe using index

In [39]:
df.drop(2,axis=0)

      name  age      skills  experience  salary location
0  jissmon   45      Python          12   54000  Chennai
1    Ajith   66  JavaScript          10   66000    Kochi

here specify the index value 2 as label and later give axis=0 which refers to index/rows in dataframe

In [41]:
df

      name  age      skills  experience  salary location
0  jissmon   45      Python          12   54000  Chennai
1    Ajith   66  JavaScript          10   66000    Kochi
2   Vikram   22        Ruby          14   30800    Delhi

# here that particular row  is not droped from our original dataframe.
        to REMOVE FROM our original dataframe
            set parameter, inplace=True

In [42]:
df.drop(2,axis=0,inplace=True)

In [43]:
df

      name  age      skills  experience  salary location
0  jissmon   45      Python          12   54000  Chennai
1    Ajith   66  JavaScript          10   66000    Kochi

In [67]:
df.drop('experience',axis=1,inplace=True)
df

      name  age      skills  salary location
0  jissmon   45      Python   54000  Chennai
1    Ajith   66  JavaScript   66000    Kochi

# Appending dataframes and form a new one

In [44]:
df

      name  age      skills  experience  salary location
0  jissmon   45      Python          12   54000  Chennai
1    Ajith   66  JavaScript          10   66000    Kochi

In [49]:
details={'name':'RaviKumar','age':23,'skills':'ReactJS','experience':11,'salary':56000,'location':'Dubai'}
df_2=pd.DataFrame(details,index=[2])
df_2

        name  age   skills  experience  salary location
2  RaviKumar   23  ReactJS          11   56000    Dubai

In [53]:
new_df=df.append(df_2)
new_df

        name  age      skills  experience  salary location
0    jissmon   45      Python          12   54000  Chennai
1      Ajith   66  JavaScript          10   66000    Kochi
2  RaviKumar   23     ReactJS          11   56000    Dubai

In [61]:
details={'name':['Jeevan'],'age':[43],'skills':['NodeJS'],'experience':[4],'salary':[55000],'location':['UK']}
df_3=pd.DataFrame(details,index=[3])
df_3

     name  age  skills  experience  salary location
3  Jeevan   43  NodeJS           4   55000       UK

In [65]:
new_df_2=new_df.append(df_3)
new_df_2

        name  age      skills  experience  salary location
0    jissmon   45      Python          12   54000  Chennai
1      Ajith   66  JavaScript          10   66000    Kochi
2  RaviKumar   23     ReactJS          11   56000    Dubai
3     Jeevan   43      NodeJS           4   55000       UK